driver-tests/httpsoapbc/ssl/HttpSSLBpel/src/InboundSSLTest/echoOverSSL.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions targetNamespace="http://j2ee.netbeans.org/wsdl/echoOverSSL"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/echoOverSSL" name="echoOverSSL" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:file="http://schemas.sun.com/jbi/wsdl-extensions/file/">
    <wsdl:types/>
    <wsdl:message name="echoOverSSLOperationRequest">
        <wsdl:part name="part1" type="xsd:string"/>
    </wsdl:message>
    <wsdl:message name="echoOverSSLOperationReply">
        <wsdl:part name="part1" type="xsd:string"/>
    </wsdl:message>
    <wsdl:portType name="echoOverSSLPortType">
        <wsdl:operation name="echoOverSSLOperation">
            <wsdl:input name="input1" message="tns:echoOverSSLOperationRequest"/>
            <wsdl:output name="output1" message="tns:echoOverSSLOperationReply"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="echoOverSSLBinding" type="tns:echoOverSSLPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="echoOverSSLOperation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/echoOverSSL"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/echoOverSSL"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="echoOverSSLService">
        <wsdl:port name="echoOverSSLPort" binding="tns:echoOverSSLBinding">
            <soap:address location="https://localhost:18181/echoOverSSLService/echoOverSSLPort"/>
        </wsdl:port>
    </wsdl:service>
    <plnk:partnerLinkType name="echoOverSSLPartner">
        <!-- partnerLinkType are automatically generated when a new portType is added. partnerLinkType are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="echoOverSSLPortTypeRole" portType="tns:echoOverSSLPortType"/>
    </plnk:partnerLinkType>
</definitions>
