driver-tests/httpsoapbc/HttpSoapBCTests/HttpSoapBCJbi/test/EchoOverSSLInvoke/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ech="http://j2ee.netbeans.org/wsdl/echoOverSSL">
  <soapenv:Body>
    <ech:echoOverSSLOperation>
      <part1>Hello World!</part1>
    </ech:echoOverSSLOperation>
  </soapenv:Body>
</soapenv:Envelope>